airfoil2D_KEPS_GAWF/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1; 

vertices
(
    (0.0 0.0 0)
    (21.0 -10.0 0)
    (1.0 -10.0 0)
    (0.0 -10.0 0)
    (-10.0 0.0 0)
    (0.0 10.0 0)
    (1.0 10.0 0)
    (21.0 10.0 0)
    (21.0 -2.4199999999999973 0)
    (21.0 -2.6199999999999974 0)
    (21.0 -2.8199999999999976 0)
    (1.0481416375664048 0.19411950631614777 0)
    (1.0 0.0 0)
    (1.00239982721866 -0.1999856015550134 0)
    (0.2360341744600171 0.2936117934283254 0)
    (0.25 0.0941 0)
    (0.25 -0.025 0)
    (0.2639658255399829 -0.22451179342832536 0)
    (-0.2 0.0 0)
    (0.0 0.0 1)
    (21.0 -10.0 1)
    (1.0 -10.0 1)
    (0.0 -10.0 1)
    (-10.0 0.0 1)
    (0.0 10.0 1)
    (1.0 10.0 1)
    (21.0 10.0 1)
    (21.0 -2.4199999999999973 1)
    (21.0 -2.6199999999999974 1)
    (21.0 -2.8199999999999976 1)
    (1.0481416375664048 0.19411950631614777 1)
    (1.0 0.0 1)
    (1.00239982721866 -0.1999856015550134 1)
    (0.2360341744600171 0.2936117934283254 1)
    (0.25 0.0941 1)
    (0.25 -0.025 1)
    (0.2639658255399829 -0.22451179342832536 1)
    (-0.2 0.0 1)
);

blocks
(
    hex (2 1 10 13 21 20 29 32) (150 57 1) simpleGrading (128.9393813596842 36.506289720778305 36.506289720778305 128.9393813596842 0.06957099986691036 0.06957099986691036 0.06957099986691036 0.06957099986691036 1 1 1 1) 
    hex (3 2 13 17 22 21 32 36) (60 57 1) simpleGrading (0.09450642831516444 2.7640430973643766 2.7640430973643766 0.09450642831516444 0.06894193669681165 0.06957099986691036 0.06957099986691036 0.06894193669681165 1 1 1 1) 
    hex (4 3 17 18 23 22 36 37) (31 57 1) edgeGrading (0.025 0.5 0.5 0.025 0.06957099986691036 0.06894193669681165 0.06894193669681165 0.06957099986691036 1 1 1 1) 
    hex (4 18 14 5 23 37 33 24) (57 31 1) edgeGrading (0.06957099986691036 0.06966029093417121 0.06966029093417121 0.06957099986691036 0.025 0.5 0.5 0.025 1 1 1 1) 
    hex (14 11 6 5 33 30 25 24) (50 57 1) edgeGrading (2.2049535575645436 0.09450642831516444 0.09450642831516444 2.2049535575645436 14.355380756950861 14.37380520494178 14.37380520494178 14.355380756950861 1 1 1 1) 
    hex (11 8 7 6 30 27 26 25) (150 57 1) simpleGrading (36.506289720778305 128.9393813596842 128.9393813596842 36.506289720778305 14.37380520494178 14.37380520494178 14.37380520494178 14.37380520494178 1 1 1 1) 
    hex (12 9 8 11 31 28 27 30) (150 11 1) simpleGrading (36.506289720778305 3.478549993345518 1) 
    hex (15 12 11 14 34 31 30 33) (50 11 1) egeeGrading (1.6 2.2049535575645436 2.2049535575645436 1.6 3.478549993345518 3.478549993345518 3.478549993345518 3.478549993345518 1 1 1 1) 
    hex (0 15 14 18 19 34 33 37) (31 11 1) edgeGrading (2 0.5 0.5 2 3.478549993345518 3.478549993345518 3.478549993345518 3.478549993345518 1 1 1 1) 
    hex (18 17 16 0 37 36 35 19) (31 11 1) edgeGrading (0.5 2 2 0.5 0.2874761040988356 0.2874761040988356 0.2874761040988356 0.2874761040988356 1 1 1 1) 
    hex (17 13 12 16 36 32 31 35) (60 11 1) edgeGrading (2.7640430973643766 1.6 1.6 2.7640430973643766 0.2874761040988356 0.2874761040988356 0.2874761040988356 0.2874761040988356 1 1 1 1) 
    hex (13 10 9 12 32 29 28 31) (150 11 1) simpleGrading (36.506289720778305 0.2874761040988356 1) 
);

edges
(
    polyLine 11 14
    (
        (0.9981416375664046 0.20881950631614776 0)
        (0.9444590599231169 0.22209587685577536 0)
        (0.8390345994979409 0.24505376632131068 0)
        (0.7320792138752781 0.2643105469247886 0)
        (0.6248069469178417 0.27985557534273353 0)
        (0.5165431150422054 0.291214639062715 0)
        (0.4056976864967619 0.29791882444778583 0)
        (0.29480175670939845 0.2975324342539042 0)
    )
    polyLine 30 33
    (
        (0.9981416375664046 0.20881950631614776 1)
        (0.9444590599231169 0.22209587685577536 1)
        (0.8390345994979409 0.24505376632131068 1)
        (0.7320792138752781 0.2643105469247886 1)
        (0.6248069469178417 0.27985557534273353 1)
        (0.5165431150422054 0.291214639062715 1)
        (0.4056976864967619 0.29791882444778583 1)
        (0.29480175670939845 0.2975324342539042 1)
    )
    polyLine 14 18
    (
        (0.16994521038034544 0.2857288790766748 0)
        (0.10684139075705457 0.27418782462871244 0)
        (0.04536076613532213 0.25829166853759816 0)
        (0.00526857441375711 0.24505006878022284 0)
        (-0.03566387855547075 0.22802548218453744 0)
        (-0.0792347618751463 0.20459011224096008 0)
        (-0.14846341686556097 0.14310458470911577 0)
        (-0.17800145290511726 0.09118926890631007 0)
    )
    polyLine 33 37
    (
        (0.16994521038034544 0.2857288790766748 1)
        (0.10684139075705457 0.27418782462871244 1)
        (0.04536076613532213 0.25829166853759816 1)
        (0.00526857441375711 0.24505006878022284 1)
        (-0.03566387855547075 0.22802548218453744 1)
        (-0.0792347618751463 0.20459011224096008 1)
        (-0.14846341686556097 0.14310458470911577 1)
        (-0.17800145290511726 0.09118926890631007 1)
    )
    polyLine 18 17
    (
        (-0.06431816941855578 -0.19895906110229758 0)
        (-0.029401732826400982 -0.21195896047075827 0)
        (0.018787196613781077 -0.2224493885203729 0)
        (0.060240356730337126 -0.22685463877922793 0)
        (0.0962673169263667 -0.22856516465892707 0)
        (0.15239982721866016 -0.2287856015550134 0)
        (0.20759451873549564 -0.22725575619725394 0)
    )
    polyLine 37 36
    (
        (-0.06431816941855578 -0.19895906110229758 1)
        (-0.029401732826400982 -0.21195896047075827 1)
        (0.018787196613781077 -0.2224493885203729 1)
        (0.060240356730337126 -0.22685463877922793 1)
        (0.0962673169263667 -0.22856516465892707 1)
        (0.15239982721866016 -0.2287856015550134 1)
        (0.20759451873549564 -0.22725575619725394 1)
    )
    polyLine 17 13
    (
        (0.3093231869398088 -0.2223825772816173 0)
        (0.408592060308672 -0.21781535601562793 0)
        (0.5079936076697743 -0.2138401917443579 0)
        (0.6074947321178188 -0.20985952314183617 0)
        (0.7060971647154892 -0.20640703985210773 0)
        (0.8042990065069184 -0.20385379101945897 0)
        (0.9030663062265194 -0.2021764930338694 0)
        (0.9523998272186601 -0.2015856015550134 0)
    )
    polyLine 36 32
    (
        (0.3093231869398088 -0.2223825772816173 1)
        (0.408592060308672 -0.21781535601562793 1)
        (0.5079936076697743 -0.2138401917443579 1)
        (0.6074947321178188 -0.20985952314183617 1)
        (0.7060971647154892 -0.20640703985210773 1)
        (0.8042990065069184 -0.20385379101945897 1)
        (0.9030663062265194 -0.2021764930338694 1)
        (0.9523998272186601 -0.2015856015550134 1)
    )
    spline 12 15
    (
        (0.95 0.0147 0)
        (0.9 0.0271 0)
        (0.8 0.0489 0)
        (0.7 0.0669 0)
        (0.6 0.0814 0)
        (0.5 0.0919 0)
        (0.4 0.098 0)
        (0.3 0.0976 0)
    )
    spline 31 34
    (
        (0.95 0.0147 1)
        (0.9 0.0271 1)
        (0.8 0.0489 1)
        (0.7 0.0669 1)
        (0.6 0.0814 1)
        (0.5 0.0919 1)
        (0.4 0.098 1)
        (0.3 0.0976 1)
    )
    arc 4 5 (-7.071072502792263 7.071063120935576 0)
    arc 3 4 (-7.071072502792263 -7.071063120935576 0)
    arc 23 24 (-7.071072502792263 7.071063120935576 1)
    arc 22 23 (-7.071072502792263 -7.071063120935576 1)
    spline 15 0
    (
        (0.2 0.088 0)
        (0.15 0.0789 0)
        (0.1 0.0659 0)
        (0.075 0.0576 0)
        (0.05 0.0473 0)
        (0.025 0.0339 0)
        (0.0125 0.0244 0)
        (0.0 0.0 0)
    )
    spline 34 19
    (
        (0.2 0.088 1)
        (0.15 0.0789 1)
        (0.1 0.0659 1)
        (0.075 0.0576 1)
        (0.05 0.0473 1)
        (0.025 0.0339 1)
        (0.0125 0.0244 1)
        (0.0 0.0 1)
    )
    spline 0 16
    (
        (0.0125 -0.0143 0)
        (0.025 -0.0195 0)
        (0.05 -0.0249 0)
        (0.075 -0.0274 0)
        (0.1 -0.0286 0)
        (0.15 -0.0288 0)
        (0.2 -0.0274 0)
    )
    spline 19 35
    (
        (0.0125 -0.0143 1)
        (0.025 -0.0195 1)
        (0.05 -0.0249 1)
        (0.075 -0.0274 1)
        (0.1 -0.0286 1)
        (0.15 -0.0288 1)
        (0.2 -0.0274 1)
    )
    spline 16 12
    (
        (0.3 -0.0226 0)
        (0.4 -0.018 0)
        (0.5 -0.014 0)
        (0.6 -0.01 0)
        (0.7 -0.0065 0)
        (0.8 -0.0039 0)
        (0.9 -0.0022 0)
        (0.95 -0.0016 0)
    )
    spline 35 31
    (
        (0.3 -0.0226 1)
        (0.4 -0.018 1)
        (0.5 -0.014 1)
        (0.6 -0.01 1)
        (0.7 -0.0065 1)
        (0.8 -0.0039 1)
        (0.9 -0.0022 1)
        (0.95 -0.0016 1)
    )
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
          (1 2 13 10)
          (2 3 17 13)
          (3 4 18 17)
          (18 4 5 14)
          (11 14 5 6)
          (8 11 6 7)
          (9 12 11 8)
          (12 15 14 11)
          (0 18 14 15)
          (17 18 0 16)
          (13 17 16 12)
          (10 13 12 9)
          (21 20 29 32)
          (22 21 32 36)
          (23 22 36 37)
          (23 37 33 24)
          (33 30 25 24)
          (30 27 26 25)
          (31 28 27 30)
          (34 31 30 33)
          (37 19 34 33)
          (37 36 35 19)
          (36 32 31 35)
          (32 29 28 31)
         );
     }
    farfield
    {
        type patch;
        faces
        (
          (4 23 24 5)
          (5 24 25 6)
          (6 25 26 7)
          (27 8 7 26)
          (28 9 8 27)
          (29 10 9 28)
          (20 1 10 29)
          (21 2 1 20)
          (22 3 2 21)
          (23 4 3 22)
         );
     }
    airfoil
    {
        type wall;
        faces
        (
          (34 15 12 31)
          (19 0 15 34)
          (0 19 35 16)
          (16 35 31 12)
         );
     }
);
