airfoil2D_KEPS_GAWF/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          64192;
        startFace       63802;
    }
    farfield
    {
        type            patch;
        nFaces          608;
        startFace       127994;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          172;
        startFace       128602;
    }
)

// ************************************************************************* //
