airfoil2D_KEPS_GAWF/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (30.222315557 7.4625 0);

boundaryField
{
    farfield
    {
        type            freestream;
        freestreamValue  $internalField;//uniform (30.222315557 7.4625 0); //13.87 degree angle
    }


    airfoil
    {
        //type           noSlip;
	    type		fixedValue;
        value		uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
